{"TCS": {"2025-06-20T12:13:44": "TCS launches 2 new automotive delivery centers in Germany, 1 engineering center in Romania  Moneycontrol", "2025-06-20T12:16:03": "AIITEU calls TCS’ bench time cap an ‘anti-worker policy’  HR Katha", "2025-06-20T12:46:58": "TCS bets big on vehicle automation: Launches three automation hubs in Europe  financialexpress.com", "2025-06-20T13:11:18": "TCS Faces Continued Decline Amid Broader Market Gains and Dividend Appeal  MarketsMojo", "2025-06-20T13:40:04": "TCS expands SDV capabilities with new centres in Germany and Romania  Business Standard", "2025-06-20T13:55:00": "TCS to boost innovation around Software-Defined Vehicle  The Hindu", "2025-06-20T13:57:15": "After TCS, Cognizant Gets 99 Paise Land from AP Govt, Promises 8,000 Jobs  outlookbusiness.com", "2025-06-20T14:07:38": "TCS expands collaboration with Microsoft to develop AI, cloud solutions  Techcircle", "2025-06-20T22:09:00": "After TCS, AP govt allots land to Cognizant in Vizag  Times of India", "2025-06-21T13:44:14": "TCS Expands European Footprint To Power Software-Defined Vehicle Innovation  Mobility Outlook", "2025-06-21T18:27:20": "Accenture Stock Crashed 7% After Q3 Earnings; Infosys, TCS, Wipro, Other Indian IT Stocks In Focus Next Week  Goodreturns", "2025-06-22T02:13:53": "Those who invested in Tata Consultancy Services (NSE:TCS) five years ago are up 81%  simplywall.st", "2025-06-22T04:56:04": "Stocks to Watch for June 23: Infosys, TCS, IT stocks, Oil stocks, HAL, BEL, Waaree Energies and more  CNBC TV18", "2025-06-23T00:47:55": "Stocks in news: TCS, Infosys, JSW Energy, Bandhan Bank, Waaree Renewable  The Economic Times"}, "INFY": {"2025-06-20T12:14:01": "Bad News For Narayana Murthy’s Infosys Employees, Bonuses Slashed Due To….  MSN", "2025-06-20T12:39:05": "Infosys Ltd Sees Surge in Active Put Options with 5,994 Contracts Traded at Rs 1,600 Strike  MarketsMojo", "2025-06-20T14:08:57": "Cannes 2025: Creativity rules but AI gains centerstage, writes Infosys' Sumit Virmani  Storyboard18", "2025-06-20T16:49:08": "Accenture shares tank 11% despite beating Q3 revenue estimates. Infosys ADRs fall 3%  The Economic Times", "2025-06-20T17:05:04": "Infosys Ltd (INFY) Shares Down 3.04% on Jun 20  GuruFocus", "2025-06-21T06:07:00": "Infosys co-founder Narayana Murthy on the impact of AI on India’s IT sector: What will happen in the futu  Times of India", "2025-06-21T18:27:20": "Accenture Stock Crashed 7% After Q3 Earnings; Infosys, TCS, Wipro, Other Indian IT Stocks In Focus Next Week  Goodreturns", "2025-06-22T01:12:06": "AI impact on Infosys, TCS: Are IT stocks still massive wealth creators? Motilal Oswal’s Raamdeo Agrawal answers  ET Now", "2025-06-22T02:06:00": "BIG setback for employees of this tech giant, set to sack over 1000 employees due to...; not Narayana Murthy's Infosys, Ratan Tata's TCS, Google, Meta, IBM, it is...  DNA India", "2025-06-22T04:56:04": "Stocks to Watch for June 23: Infosys, TCS, IT stocks, Oil stocks, HAL, BEL, Waaree Energies and more  CNBC TV18", "2025-06-22T04:59:43": "AI impact on Infosys, TCS: Are IT stocks still massive wealth creators? Motilal Oswal’s Raamdeo Agrawal answers  MSN", "2025-06-22T11:52:00": "Infosys founder Narayana Murthy on why he sees no difference between management and technology graduates  Times of India", "2025-06-23T00:30:00": "Infosys’ Bengaluru, Chennai, Pune centres top April on-site attendance numbers  The Economic Times", "2025-06-23T00:47:55": "Stocks in news: TCS, Infosys, JSW Energy, Bandhan Bank, Waaree Renewable  The Economic Times", "2025-06-23T01:13:57": "Stocks in news: TCS, Infosys, JSW Energy, Bandhan Bank, Waaree Renewable  MSN"}, "RELIANCE": {"2025-06-20T12:15:57": "Whirlpool India Stake Sale Race Heats Up as Reliance, Havells Join the Fray  outlookbusiness.com", "2025-06-20T16:22:00": "Boycott call at Reliance Smart in Hyderabad over ties with Israel  Siasat.com", "2025-06-21T07:59:00": "Meet man, Mukesh Ambani's 'right hand' who quit top post at Reliance with Rs 750000000 salary to become monk,  India.Com", "2025-06-22T04:39:23": "Mcap of 6 of top-10 most valued firms jumps Rs 1.62 lakh cr; Airtel, Reliance biggest gainers  The Economic Times", "2025-06-22T04:46:13": "Mcap of 6 of top-10 firms jumps ₹1.62 trn; Airtel, Reliance biggest gainers  Business Standard", "2025-06-22T04:55:00": "Mcap of 6 of top-10 most valued firms jumps ₹1.62 lakh crore; Airtel, Reliance biggest gainers  The Hindu", "2025-06-22T08:32:00": "Market rally: Top-10 firms add Rs 1.62 lakh crore in market cap; Airtel, Reliance lead gains  Times of India"}, "HDFCBANK": {"2025-06-20T12:20:43": "G. Ramesh Of HDB Financial Services , NBFC Arm Of HDFC Bank Talk About Their Rs 12,500 Crore IPO  Business Today", "2025-06-20T14:16:07": "Lilavati Trust files Rs 1,000 cr defamation suit against HDFC Bank CEO  The Economic Times", "2025-06-20T18:55:00": "HDB Financial IPO: 10% Issue Reserved For HDFC Bank Shareholders; Check GMP, Price, Opening Date  News18", "2025-06-20T23:54:00": "Lilavati Trust files Rs 1,000-crore defamation suit against HDFC Bank, its CEO  The Indian Express", "2025-06-21T03:02:03": "Lilavati trust slaps ₹1,000-crore defamation suit on HDFC Bank CEO  Hindustan Times", "2025-06-21T05:56:48": "HDFC Bank dividend 2025 record date next week; highest-ever amount since stock split  ET Now", "2025-06-21T06:33:05": "Lilavati Trust files Rs 1000 crore defamation case against HDFC Bank CEO  Deccan Chronicle", "2025-06-21T10:09:12": "HDFC Bank AGM scheduled  Capital Market", "2025-06-21T10:50:47": "‘ICICI started HDFC, why don’t you come back home?’: Deepak Parekh recalls Chanda Kochhar’s proposal  financialexpress.com", "2025-06-21T11:02:15": "HDFC Bank’s HR Head Vinay Razdan Steps Down  BW People", "2025-06-21T13:16:30": "Lilavati Trust initiates Rs 1,000 crore defamation lawsuit against HDFC Bank CEO  financialexpress.com", "2025-06-22T05:36:14": "Dividend Stocks To Watch This Week — HUL, Vedanta, HDFC Bank, Bajaj Finserv  NDTV Profit", "2025-06-22T07:31:07": "HDB Financial’s Rs 12,500 crore IPO: 10 insights that reveal the HDFC Bank arm’s bigger ambitions  The Economic Times"}, "MARUTI": {"2025-06-20T12:26:25": "New Maruti Compact SUV In Works! To Be Called Maruti Escudo?  ZigWheels.com", "2025-06-20T13:07:46": "Maruti Suzuki Swift completes 20 years in India  EVO India", "2025-06-20T14:14:53": "2025 Maruti Suzuki Grand Vitara CNG: 5 reasons to buy  Hindustan Times", "2025-06-20T20:01:00": "Maruti Swift Marks 20th Anniversary With Four Generations Of Development  Deccan Chronicle", "2025-06-21T05:49:00": "Maruti Suzuki Swift completes 20 years on road. Here are 5 reasons why the hatchback is still relevant  HT Auto", "2025-06-21T06:26:00": "Maruti Swift Completes 20 Years In India, Here’s A Look Back At Its Journey Since 2005  CarDekho", "2025-06-21T06:29:37": "EXCLUSIVE: Maruti Suzuki e Vitara Spotted On Indian Roads  ACKO Drive", "2025-06-22T04:01:00": "Maruti Escudo: Is It Maruti's New Creta-rival?  CarDekho", "2025-06-22T07:51:36": "Maruti Suzuki Swift’s 20-year India journey in images: 2005 to 2025  Times of India", "2025-06-22T09:03:50": "Maruti Suzuki Ertiga to Renault Triber: Three most value-for-money MPVs in India under ₹15 lakh  Mint", "2025-06-22T10:18:51": "Maruti Suzuki e Vitara Snapped Testing Again, What We Know So Far?  NDTV", "2025-06-22T10:22:03": "Maruti Suzuki Swift Completes 20 Years with 30 Lakh Sales  CarWale", "2025-06-22T13:06:48": "Forget the brochure: Here is Maruti Dzire’s real mileage  financialexpress.com"}, "SBIN": {"2025-06-20T12:37:21": "Hackers Exploit ComfyUI 700+ AI Image Generation Servers to Deploy Malware  CyberSecurityNews"}, "LT": {"2025-06-20T12:38:59": "How Should India Handle the Next Conflict With Pakistan? Lt Gen Hooda Speaks  The Quint", "2025-06-20T12:49:56": "US imposes 340.7% countervailing duty on LT Foods arm Ecopure’s organic soybean meal exports  CNBC TV18", "2025-06-20T13:15:40": "Lt. Casey Reynolds furthers his career in the Coast Guard with an online master’s degree  Boise State University", "2025-06-20T14:26:00": "What Big Tech's Band of Execs Will Do in the Army  WIRED", "2025-06-20T15:36:42": "IDF chief says Israelis must prepare for ‘prolonged campaign’ against Iran  The Times of Israel", "2025-06-20T15:55:22": "Lt Governor's message On International Day of Yoga  Jammu Links News", "2025-06-20T16:19:35": "Zamir: IDF strikes Iran’s growing missile threat, ensure Israel's safety  The Jerusalem Post", "2025-06-20T19:35:00": "IDF chief warns Israelis must brace for ‘prolonged campaign’ against Iran  The Times of Israel", "2025-06-21T10:51:18": "Lt Guv joins Yoga enthusiasts to celebrate International Day of Yoga 2025  Kashmir Vision", "2025-06-21T14:26:00": "Virginia Lieutenant Governor Primary Election Results 2025  The New York Times", "2025-06-21T15:03:02": "Lt Governor joins Yoga Enthusiasts to celebrate International Day of Yoga 2025  Jammu Links News", "2025-06-21T17:27:49": "Lt Gen Ghani quits as Pakistan Water Authority head amid IWT rift  The Economic Times", "2025-06-21T20:50:07": "Lt Guv joins Yoga enthusiasts, performs yoga  Kashmir Vision", "2025-06-22T00:11:06": "Retired Lt. Gen. warns any U.S. operation against Iran’s nuclear program comes with heavy risks  MSN", "2025-06-22T04:24:40": "Iran & Nobel: How Trump Used Munir And Why India Must Ignore It | Lt Gen Syed Ata Hasnain (Retd)  MSN", "2025-06-22T09:02:03": "US Strikes Fordow, Natanz & Isfahan | Trump: “Very Successful” | Lt Gen D.P. Pandey Reacts  News18", "2025-06-22T19:11:25": "Pro-ISI Lt Gen Zahirul Alam set to be Bangladesh's Dy NSA  The Economic Times", "2025-06-22T23:25:00": "Second only to L&T, but controversies may weaken this infra powerhouse’s growth story  The Economic Times", "2025-06-23T00:40:26": "Lt General of Delhi Vinai Kumar Saxena called on Governor Acharya Devrat on Sunday  Ahmedabad Mirror"}, "ASIANPAINT": {"2025-06-20T13:00:58": "Asian Paints Share Price Highlights: Asian Paints Stock Price History  The Economic Times", "2025-06-20T16:52:42": "Asian Paints unveils 'Royale Glitz-Tribute to Odisha' Special Edition Pack  ODISHA RAY"}, "ITC": {"2025-06-20T13:04:30": "ITC Share Price Highlights: ITC Stock Price History  The Economic Times", "2025-06-20T13:46:55": "Rs. 18.95 Cr GST Shock! Greenply Hit with Massive ITC Demand: Legal Battle Ahead  Studycafe", "2025-06-20T13:49:09": "ITC launches digital campaign showcasing ‘Filo Series,’ a sustainable food packaging innovation  MediaBrief", "2025-06-20T14:28:45": "Rs 400 crore deal: ITC acquires THIS famous organic foods company  MSN", "2025-06-20T15:46:00": "HC Quashed ITC disallowance; Purchaser Cannot Be Penalised for Seller’s Default  Studycafe", "2025-06-20T18:27:00": "US importer challenges ITC determination on herbicide  MLex", "2025-06-21T00:30:37": "ITC WOW recognises students, schools for contribution towards Clean India Mission  The Tribune", "2025-06-21T01:19:00": "State GST Dept Arrests Businessman for Rs 25 Crore Fake ITC Scam  CAclubindia", "2025-06-21T04:22:00": "Asus fends off bid to ban US laptop imports in Lenovo patent dispute  The Straits Times", "2025-06-21T04:41:37": "ITC’s Filo Series delivers scalable, sustainable, and food-safe packaging innovation  MediaNews4U", "2025-06-21T05:04:02": "ITC wraps up a win with Filo, its new planet-friendly packaging series  Indian Television Dot Com", "2025-06-21T05:51:27": "Enjoying this Mughlai Dum Ki Raan is your cue to feast this weekend  Indulgexpress", "2025-06-21T06:17:00": "ITC launches new digital campaign featuring the Filo Series  Adgully.com", "2025-06-21T06:41:27": "Rajasthan High Court Denies Bail in 704 Crore GST ITC Scam  Studycafe", "2025-06-21T07:20:41": "ITC Sunfeast Baked Creations bids farewell to summer with a Mango-loaded dessert finale  MediaNews4U", "2025-06-21T07:49:06": "Design & Engineering Services to Foreign Entities Are Zero-Rated Supplies: Bombay HC Allows Refund of Unutilized ITC u/s 54 of CGST Act [Read Order]  Taxscan", "2025-06-21T08:05:29": "ITC Maurya hosts Aqua Yoga session on International Yoga Day  BW Hotelier", "2025-06-21T08:23:25": "Hotel stocks in India: 15 famous brands that are listed - FULL list with share price  ET Now", "2025-06-21T10:48:19": "Wellness with Purpose: ITC Kohenur Hosts Conscious Yoga Day Celebration  HospiBuz", "2025-06-21T10:55:28": "GST SCAM: CGST Uncovers 23.48 Crore ITC Fraud by Scrap Trading Firm  Studycafe", "2025-06-21T12:44:03": "ITC Maurya Celebrates International Yoga Day with a Soulful Morning of Movement and Mindfulness  Passionate In Marketing", "2025-06-22T05:08:19": "Amitabh Sharma | Ethical Fashion Initiative – elevating traditional crafts to haute couture  Jamaica Gleaner", "2025-06-22T06:57:00": "ITC on car purchase claimed in May2025 by oversight, is it to pay by filing DRC03 or to reverse  CAclubindia", "2025-06-22T09:19:04": "GST: HC Says Back Office with Cost Plus Model Not Agency, Allows Export Refund  Studycafe", "2025-06-22T21:30:00": "Teeing off with t2: Gaurav Soneja reflects on six years of ITC Royal Bengal  t2ONLINE", "2025-06-23T01:30:00": "ITC, Gravita India and 3 other fundamentally strong stocks trading below 200 DMA to keep on your radar  Trade Brains"}, "TITAN": {"2025-06-20T13:48:56": "Amazon (AMZN) Stock: A Titan of Growth with Over 174,000% All-Time Return, Showing Strong Recent Momentum  Daily Chhattisgarh News", "2025-06-20T13:49:58": "Microsoft Stock: A Titan of Tech Boasting 142% Five-Year Gain and Astronomical All-Time Returns  Daily Chhattisgarh News", "2025-06-20T14:10:07": "UnitedHealth (UNH) Cements Legacy as a Wealth-Creating Titan with 212,000% All-Time Return  Daily Chhattisgarh News", "2025-06-20T14:16:01": "Cisco's 85,000% All-Time Return Underscores Its Legacy as a Tech Titan, Stock Jumps Over 44% in a Year  Daily Chhattisgarh News", "2025-06-20T16:16:00": "How to Defeat a Titan in LEGO Fortnite Expeditions  Game Rant", "2025-06-20T17:00:00": "Smoke On!  Plane & Pilot Magazine", "2025-06-20T19:28:46": "Moody’s lowers Titan International outlook to negative  Investing.com", "2025-06-20T23:59:00": "10 Best Attack on Titan Figures (& Where to Buy Them)  Comic Book Resources", "2025-06-21T02:11:06": "Titan (NSE:TITAN) Has Affirmed Its Dividend Of ₹11.00  simplywall.st", "2025-06-21T02:28:30": "Returns on Capital Paint A Bright Future For Titan (NSE:TITAN)  simplywall.st", "2025-06-21T06:08:13": "Titan Company - These 6 stocks showed RSI Trending Up on June 19  The Economic Times", "2025-06-21T08:46:42": "Titan Mining subsidiary secures $15m funding from EXIM for critical minerals development  MSN", "2025-06-21T12:11:53": "Lenskart tells Delhi High Court its use of Titan trademark was a mistake  Bar and Bench", "2025-06-21T22:07:00": "Saturn's largest moon Titan has a baffling atmosphere that wobbles and spins like a gyroscope  The Brighter Side of News", "2025-06-22T07:10:15": "Real Reason Attack on Titan Finally Found a Publisher After Constantly Being Rejected: “There was no comparing him to a professional mangaka”  IMDb", "2025-06-22T08:38:44": "The Titan, the Max, and the cult of the visionary  The Express Tribune", "2025-06-22T08:56:21": "Kolkata Knight Riders vs Gujarat Titans, 39th Match  Cricbuzz.com", "2025-06-22T10:49:20": "Dita gohilwad titans  Cricketnmore", "2025-06-22T11:27:27": "From Trump To Titan: Timeline Of Simpsons Predictions That Came True  Zee News", "2025-06-22T11:48:17": "Pro Kabaddi League Highlights, PKL 2024: Telugu Titans wins thriller against U Mumba; Naveen’s heroics secure tie for Dabang Delhi vs Gujarat Giants  Sportstar", "2025-06-22T13:00:00": "Titan International: A Downgrade For The Sake Of Safety (NYSE:TWI)  Seeking Alpha", "2025-06-22T17:55:52": "Industry titan Fred Smith, FedEx founder and executive chairman, passes away  logisticsmgmt.com"}, "AXISBANK": {"2025-06-20T14:16:53": "ICICI, Axis Bank To Move Away From DreamFolks After Lounge Access Disruption  NewsX", "2025-06-21T03:32:34": "Axis Bank Share Price Target Raised To Rs 1,400: Should You Buy The Stock Now? Emkay Explains  Republic World", "2025-06-21T05:42:02": "Bank dividend stocks: HDFC Bank, Axis Bank and 3 others - check amount, record date  ET Now", "2025-06-21T17:26:42": "Odisha Govt removes HDFC, ICICI, Axis Bank to handle business and deposits of State Government, watch  KalingaTV", "2025-06-21T17:43:31": "Odisha Govt De-empanels Three Private Banks  Pragativadi", "2025-06-22T06:45:21": "Odisha government bars HDFC, ICICI and Axis Bank from handling State funds over poor performance  The New Indian Express", "2025-06-22T11:13:18": "7 Stocks to buy for long term: Analysts recommend largecap, midcap stocks; Axis Bank, Ambuja Cements on the list  Zee Business", "2025-06-22T12:14:04": "Odisha removes HDFC Bank, ICICI Bank, and Axis Bank as authorised banks for govt businesses  The Economic Times", "2025-06-23T01:28:33": "State directs immediate closure of accounts with HDFC, ICICI, and Axis Bank!  Prameyanews"}, "ICICIBANK": {"2025-06-20T14:46:46": "Thane Sessions Court Acquits 46-Year-Old Man In 2016 Murder Case Of ICICI Bank Staffer, Cites Lack Of Evidence  Free Press Journal", "2025-06-20T22:10:00": "ICICI sought to acquire HDFC, reveals chairman Deepak Parekh  Times of India", "2025-06-21T05:13:28": "Chanda Kochhar once proposed HDFC-ICICI merger, reveals Deepak Parekh  Business Standard", "2025-06-21T06:35:02": "Deepak Parekh reveals ICICI Bank once proposed merger with HDFC  Moneycontrol", "2025-06-21T07:08:45": "ICICI Bank Alert: New Service Charges on ATM, Cash Withdrawals & Int'l Transactions Effective from July 1st  Goodreturns", "2025-06-21T07:38:31": "ICICI Bank once wanted to acquire HDFC, Deepak Parekh spills the secret  The Economic Times", "2025-06-21T09:16:34": "ICICI Bank's Bid for HDFC: The Unseen Merger Twist  Devdiscourse", "2025-06-21T09:26:29": "ICICI Bank wanted to merge with HDFC, says Deepak Parekh  NewsBytes", "2025-06-21T09:27:32": "ICICI Bank made an offer to acquire HDFC Ltd before reverse merger: Parekh  Newsd.in", "2025-06-21T09:56:51": "Deepak Parekh Reveals Why Chanda Kochhar Wanted To Merge ICICI Bank With HDFC  Live India", "2025-06-21T09:59:52": "ICICI Bank once tried to acquire HDFC, says Deepak Parekh  BusinessLine", "2025-06-21T10:44:16": "ICICI Bank Made An Offer To Acquire HDFC Ltd Before Reverse Merger: Parekh  ETV Bharat", "2025-06-21T10:50:47": "‘ICICI started HDFC, why don’t you come back home?’: Deepak Parekh recalls Chanda Kochhar’s proposal  financialexpress.com", "2025-06-21T10:59:20": "Did ICICI Bank Try To Acquire HDFC? What Deepak Parekh Reveals  News18", "2025-06-21T11:17:15": "When ICICI Tried to Take Over HDFC - Deepak Parekh Reveals Untold Story  Times Now", "2025-06-21T12:43:29": "ICICI Bank revises charges on ATM transactions, cash deposits, cash withdrawals, IMPS and more  MSN", "2025-06-21T13:13:28": "ICICI-HDFC merger talks: ‘That was your offer…’ – Did Chanda Kochhar ask Deepak Parekh to ‘come back home’?  ET Now", "2025-06-21T13:36:58": "ICICI-HDFC Merger Almost Happened? Deepak Parekh Shares Surprising Detail  Zee News", "2025-06-21T13:50:20": "Deepak Parekh's Shocking Revelation: How Chanda Kochhar Proposed HDFC-ICIC Merger Talks Before 2023  TechnoSports Media Group", "2025-06-21T13:55:14": "HDFC Chairman Deepak Parekh Reveals ICICI Once Courted HDFC For Merger  MSN", "2025-06-21T15:49:11": "Deepak Parekh's BIG revelation: Chanda Kochhar had proposed ICICI Bank-HDFC merger. Here's what he replied  Mint", "2025-06-21T17:02:39": "'ICICI Bank once tried to...': Ex-HDFC Bank chief Deepak Parekh's BIG revelation, says Chanda Kochhar had...  India.Com", "2025-06-21T17:10:23": "ICICI Bank Made Offer To Acquire HDFC Ltd Before Reverse Merger: Ex-Chairman Deepak Parekh  MSN", "2025-06-21T17:26:42": "Odisha Govt removes HDFC, ICICI, Axis Bank to handle business and deposits of State Government, watch  KalingaTV", "2025-06-21T17:31:00": "When Deepak Parekh declined ICICI Bank’s offer to takeover HDFC  The New Indian Express", "2025-06-21T17:31:14": "When The Wolves Protect The Vault: Decoding ICICI Bank’s Internal Fraud Network!  inventiva.co.in", "2025-06-21T17:43:31": "Odisha Govt De-empanels Three Private Banks  Pragativadi", "2025-06-21T19:04:14": "ICICI Bank, SBI, L&T May Benefit From RBI’s Infra Lending Relief: SEBI RIA Cashvisory  MSN", "2025-06-21T19:53:04": "HDFC Chairman Deepak Parekh Reveals ICICI Once Courted HDFC For Merger  MSN", "2025-06-22T08:50:26": "New Rules From July 1: ICICI Bank Revises Charges For ATM, Debit Card, IMPS & Cash Transactions  Free Press Journal", "2025-06-22T10:00:44": "New Rules From July 1: ICICI Bank Revises Charges For ATM, Debit Card, IMPS & Cash Transactions  MSN", "2025-06-22T12:14:04": "Odisha removes HDFC Bank, ICICI Bank, and Axis Bank as authorised banks for govt businesses  The Economic Times", "2025-06-22T13:33:25": "'ICICI Bank once tried to...': Ex-HDFC Bank chief Deepak Parekh's BIG revelation, says Chanda Kochhar had...  MSN"}, "HCLTECH": {"2025-06-20T17:52:01": "Just energy partners with HCLTech for AI-led business transformation  MSN", "2025-06-21T04:15:09": "HCL Technologies to hold board meeting  Capital Market", "2025-06-21T17:38:30": "HCL Tech Dividend: Cash reward in Q1 results 2026; quarterly earnings announcement date, time  ET Now", "2025-06-21T20:28:06": "From classroom to career: Jharkhand, HCL Tech sign MoU for IT Training and job pathway  MSN", "2025-06-22T11:28:45": "HCLTech Share Price Spikes After Announcing Partnership With US Software Firm UiPath  MSN", "2025-06-22T13:58:53": "HCL Tech Dividend: Cash reward in Q1 results 2026; quarterly earnings announcement date, time  MSN", "2025-06-23T00:14:00": "How HCLTech is helping leaders turn vision into value with AI  CNA"}, "KOTAKBANK": {"2025-06-22T19:47:52": "Trade Spotlight: How should you trade Indus Towers, Kotak Mahindra Bank, NRB Bearings, ICICI Lombard, KFin Technologies, M&M, and others on June 23?  TradingView"}}