{"M&M": {"2025-06-24T12:00:00": "ForSight Robotics Secures $125M in Series B Funding, Addressing Global Surgeon Shortage and Exploding Demand for Ophthalmic Surgery  Business Wire", "2025-06-24T12:05:26": "Christopher M. Beeler  Heafey Hoffmann Dworak Cutler", "2025-06-24T12:28:47": "Digital Asset secures $135m to advance blockchain integration  Yahoo Finance", "2025-06-24T12:31:55": "NVDA Insider Trade Alert! CEO Sells $14.4M Nvidia Stock as Part of $865M Disposal Plan  TipRanks", "2025-06-24T12:53:27": "Digital Asset raises $135M to scale Canton blockchain network  Cointelegraph", "2025-06-24T13:00:00": "Superfiliate Raises $2M to Help CPG and DTC Brands Run Their Influencer Marketing  Adweek", "2025-06-24T13:02:14": "WNBA Team Values 2025: Valkyries No. 1 at $500M, Average Up 180%  Sportico.com", "2025-06-24T13:23:48": "‘Why I’m hanging up my carbon-plate shoes – at least until my feet and ankles are stronger’  Runner's World", "2025-06-24T14:00:14": "The Basketball Tournament Releases 2025 Bracket Ahead of $1M, Winner-Take-All Event  FOX Sports", "2025-06-24T14:09:00": "Here's How You Can Get Paid From AT&T's $177M Data Breach Settlement  CNET", "2025-06-24T14:16:51": "Nano Labs to issue $500M of convertible notes to fund BNB treasury  Cointelegraph", "2025-06-24T15:05:00": "I became a mom in my 40s. It made me healthier, more creative, and bold enough to launch a business during naptime.  Business Insider", "2025-06-24T15:32:28": "Historic drug bust nets 8 cartel arrests, $4.5M in fentanyl seized, sheriff says  WFTV", "2025-06-24T15:36:00": "‘Is this normal?’ I’m 40 and inherited an IRA worth $650K. It has grown to $1M over five years. But I had a pro look at my investments and one-third are underperforming  MarketWatch", "2025-06-24T15:53:00": "nCINO Chief Marketing Officer indicted for embezzling $6M from past employers  WECT", "2025-06-24T15:57:00": "With state health benefit costs rising ‘astronomically,’ Murphy seeks $100M in cuts  NJ.com", "2025-06-24T17:00:00": "Meet Tang Pie: The 5-Ingredient Dessert Recipe I'm Making All Summer Long  Allrecipes", "2025-06-24T17:14:06": "Aaron Rodgers: 'I'm pretty sure this will be my last season'  NBC News", "2025-06-24T17:19:00": "LSU awards nearly $1M for energy research projects  The Center Square", "2025-06-24T17:41:13": "WRPS to pay $6.5M settlement for allegedly claiming fraudulent labor hours  Tri-Cities Area Journal of Business", "2025-06-24T19:19:51": "Hut 8 Doubles Bitcoin-Backed Loan With Coinbase to $130M, Locks in Lower Rate  Yahoo Finance", "2025-06-24T19:42:00": "Donna M. Dill  Hastings Tribune", "2025-06-24T19:43:06": "Russell Wilson asked Broncos for $350M in 2022; owner Greg Penner wondered if deal needed to happen at all, document shows  The Denver Post", "2025-06-24T19:44:14": "Trump cites presidential immunity to try to toss out $83M judgment he owes to E. Jean Carroll  Politico", "2025-06-24T19:55:00": "US offers up to $5M reward for return of Afghan American detained by Taliban  The Hill", "2025-06-24T20:08:48": "Jane M. Lehman  Watertown Daily Times", "2025-06-24T20:12:44": "Wizards Acquire CJ McCollum to Set Up $100M in 2026 Cap Space  Front Office Sports", "2025-06-24T20:18:54": "Denver City Council adds $4.5M to fund existing contract with Salvation Army for male-only shelter  CBS News", "2025-06-24T20:30:00": "Obituary: John M. \"Jack\" Curran  What's Up Newp", "2025-06-24T20:32:46": "PGA Tour’s $20M Signature Events Finish 2025 Season Up in TV Ratings  Front Office Sports", "2025-06-24T20:40:11": "Report: Russell Wilson Asked Broncos for $350M Extension in 2022  Sports Illustrated", "2025-06-24T20:46:28": "Founder steals $100M from his FL disability nonprofit, buys properties, feds say  Miami Herald", "2025-06-24T20:52:45": "Obituary and funeral service: Barbara ‘Nana’ M. Garrison, 83, of Loganville  Monroe Local News", "2025-06-24T20:52:58": "Training Tuesdays with M - Strength Training  SCVTV.com", "2025-06-24T20:53:33": "NGA Awards BlackSky Potential $24M Luno A Task Order for AI-Based Analytics  Via Satellite", "2025-06-24T21:00:00": "JPMorgan Chase pledges $1M to New Orleans nonprofits to support small businesses  NOLA.com", "2025-06-24T21:03:00": "Little Rock Zoo breaks ground on $12M project to build new habitats  The Arkansas Democrat-Gazette", "2025-06-24T21:05:36": "Powerball player in Murfreesboro wins $2 million prize  WKRN News 2", "2025-06-24T21:11:00": "Modern Cowboy-Core Charm Fills a Nearly $15M Home in Jackson, Wyoming  Mansion Global", "2025-06-24T21:12:07": "$79M Seattle-area home is now most expensive listing in Pacific Northwest  FOX 13 Seattle", "2025-06-24T21:14:00": "Gov. Kelly announces $5.3M for KDOT Cost Share Program projects  WIBW", "2025-06-24T21:19:03": "Remembering Donna Holovnia, A Life Filled With Love And Community Spirit  WJON", "2025-06-24T21:21:20": "Eden Prairie investor buys Blaine retail center for $3.15M  Finance & Commerce", "2025-06-24T21:23:54": "Michigan Fund Awards $3M for Driverless Truck Engineering Hub  GovTech", "2025-06-24T21:31:38": "BMW to Replace Carbon Fiber with Flax-Based Alternative on New M Cars  Car and Driver", "2025-06-24T21:44:59": "Can $300M put Texas in the movie business? Houston hopes so.  Chron", "2025-06-24T21:54:41": "PSP's $1M investment expands CDL training at New Mexico Junior College  Midland Reporter-Telegram", "2025-06-24T21:56:15": "Braun clarifies Indiana acquisition of execution drugs; reveals more than $1M spent  Indiana Capital Chronicle", "2025-06-24T22:02:58": "Ohio lawmakers settle on unclaimed funds to put $600M into new Browns stadium  News 5 Cleveland WEWS", "2025-06-24T22:15:59": "Big changes are coming to F and M trains this fall, says MTA—here’s what to expect  Time Out", "2025-06-24T22:16:03": "Honoring Evelyn Neis, A Life Woven With Love, Family, And Faith  WJON", "2025-06-24T22:20:31": "Penn Athletics Announces Change In Leadership Of Men’s Lacrosse Program  University of Pennsylvania Athletics", "2025-06-24T22:20:37": "Bexar County Commissioners approve $5M for UTSA athletics facility  San Antonio Report", "2025-06-24T22:24:27": "$2M for violence prevention included in State budget, what could this mean for Austin?  KXAN Austin", "2025-06-24T22:26:09": "Justice Department orders Greystar to pay over $1.4m for illegal fees on US servicemembers  WPDE", "2025-06-24T22:27:12": "$1.5M in cocaine seized at South Texas bridge  Yourbasin", "2025-06-24T22:30:00": "Wilkinson County approves $2.9M roundabout to curb deadly crashes | Here's what we know  13WMAZ", "2025-06-24T22:33:00": "US to give $30m to group accused of ‘politicizing’ food distribution in Gaza  The Guardian", "2025-06-24T22:33:17": "Former Heinz Endowment employee accused of embezzling nearly $1M from the foundation  WPXI", "2025-06-24T22:35:00": "Judge's ruling halts $440M road bond plan in Hays County  KVUE", "2025-06-24T22:36:37": "Lawsuit filed against Prairie Village for trying to build $30M city hall without public vote  FOX4KC.com", "2025-06-24T22:46:00": "Cape Coral's $45M Bimini East plan stirs mixed reactions  WINK News", "2025-06-24T22:51:51": "Gardener’s Supply draws $9M bid as Vermont vendors await payment  VTDigger", "2025-06-24T22:53:00": "Seattle eyes $1K fines for illegal graffiti causing $6M in annual cleanup costs  The Center Square", "2025-06-24T22:59:00": "Browns’ Brook Park project State funding will move forward with $600M Unclaimed Funds plan  Cleveland 19 News", "2025-06-24T23:01:03": "Synthflow AI raises $20M to transform the global conversational AI market  Tech.eu", "2025-06-24T23:01:09": "Three years, $98M dollars later state-of-the-art RI public health lab nears completion  Rhode Island Current", "2025-06-24T23:02:15": "St. Gregory A. & M. Hovsepian 6th & 7th Graders Create Life-Changing Wearables  Pasadena Now", "2025-06-24T23:14:19": "Trump’s ag boss is cutting 3.3M ‘roadless’ acres from 9 national forests in Wyoming  WyoFile", "2025-06-24T23:19:07": "California ranks second in health care data breaches as 22.6M records exposed  thebusinessjournal.com", "2025-06-24T23:19:22": "'I'm an example of why this is needed': Malvern childcare center to open soon  KMTV 3 News Now Omaha", "2025-06-24T23:20:38": "Doug Russell Aquatic Center reopens after $6.5M renovation in Midland  Midland Reporter-Telegram", "2025-06-24T23:29:20": "Rodgers on retirement: 'I'm pretty sure this is my last season' | 'The Insiders'  NFL.com", "2025-06-24T23:36:55": "Gloria M. Schwab Obituary June 24, 2025  Parker Kohl Funeral Home & Crematory", "2025-06-24T23:39:01": "Medical AI startup Abridge closes $300M investment at $5.3B valuation  SiliconANGLE", "2025-06-24T23:42:00": "Ector County approves Courthouse Project at USPS Site, paving way for downtown transformation  newswest9.com", "2025-06-24T23:44:00": "Gov. Kelly announces $5.3M for KDOT Cost Share Program projects  WIBW", "2025-06-24T23:48:00": "Little Rock airport panel approves spending up to $96M to construct central utility plant and geothermal system  Northwest Arkansas Democrat-Gazette", "2025-06-24T23:50:34": "Fort Worth City Council approves $125M in incentives for new mixed-use development  Fort Worth Report", "2025-06-24T23:53:38": "LA City to take out $17.3M loan to cover OT pay for LAPD during ICE protests  FOX 11 Los Angeles", "2025-06-25T00:02:00": "NYSEG, RG&E have invested $90M in tree trimming, company says  Fingerlakes1.com", "2025-06-25T00:28:00": "Former McKeesport detective pleads guilty to stealing more than $1M from FOP union lodge  WPXI", "2025-06-25T01:18:10": "How the Celtics Cut $500M Roster Bill Nearly By Half in 1 Day  Front Office Sports"}, "TITAN": {"2025-06-24T12:00:02": "With Titan Davis off the board, here's who's left for Alabama on the DL in 2026  Bama Hammer", "2025-06-24T12:00:58": "Netflix’s ‘Titan’ Documents the Deep-Sea Disaster Many Saw Coming  Explorersweb »", "2025-06-24T12:40:00": "An Epic New Adventure from Titan Begins in CONAN THE BARBARIAN: SCOURGE OF THE SERPENT Miniseries  Get Your Comic On", "2025-06-24T14:00:00": "Titan International Launches ITP Savage UTV Tire Line  Tire Review Magazine", "2025-06-24T15:42:44": "Tri-County Titan Seniors Defeat Wakefield Post 81  KBRX", "2025-06-24T16:00:00": "EXCLUSIVE: Get A First Look at Titan Manga’s Toxic Super Beasts Volume 2  Anime Trending", "2025-06-24T16:19:57": "Unihertz Titan 2 is an Android-powered BlackBerry Passport clone (crowdfunding)  Liliputing", "2025-06-24T16:35:00": "One Destiny 2 The Edge of Fate Exotic May Be Dead on Arrival  Game Rant", "2025-06-24T17:28:21": "Secretlab TITAN Evo gaming chair review — The Cadillac of gaming chairs  GamingTrend", "2025-06-24T17:44:02": "Monmouth-Roseville Titan Boys Basketball Enjoying Successful Summer  Radio Monmouth, IL", "2025-06-24T19:25:00": "Titan 2: Smartphone with physical keyboard and BlackBerry vibes now available  Notebookcheck", "2025-06-24T19:49:04": "Titan Has Not Received Payments From Diamond Comics, Stops Supplying  Bleeding Cool News", "2025-06-24T20:00:00": "The Titan 2 is a modernized BlackBerry with 5G, Android, and a second screen  The Verge", "2025-06-24T21:25:51": "BlackBerry Passport-Inspired Unihertz Titan 2 Smartphone Launches, Costs $269  TechEBlog -", "2025-06-25T01:04:08": "Attack on Titan Iconic Scenes & Quotes Turned Into Apparel  The Outerhaven"}, "SBI": {"2025-06-24T12:11:54": "SBI PO 2025 recruitment opens for 541 posts: Check details, how to apply, last application date  MSN", "2025-06-24T12:15:27": "SBI loan interest rates June 2025: Check latest home loan rates here  The Economic Times", "2025-06-24T12:49:23": "Warburg Pincus explores stake sale in India’s SBI General Insurance  Yahoo", "2025-06-24T14:35:05": "SBI organises mega blood donation camp in Khammam  Telangana Today", "2025-06-24T14:35:30": "Japan's SBI Shinsei Bank to Repay All Remaining Public Funds  nippon.com", "2025-06-24T14:58:35": "Warburg Pincus eyes exit from SBI General Insurance in deal valuing firm at $4.5bn  Private Equity Insights", "2025-06-24T15:51:29": "Buy, Sell Or Hold: Sharda Motor, SBI Life, KPIT Tech, Ramky Infra, GMDC, Jindal Saw — Ask Profit  NDTV Profit", "2025-06-24T16:06:58": "BLS E-Services Subsidiary Inks DeaL To Acquire CSPs Of SBI, HDFC Bank  BW Businessworld", "2025-06-24T16:36:31": "BLS E-Services arm to acquire SBI, HDFC Bank CSPs for ₹6.5 crore  CNBC TV18", "2025-06-24T16:44:33": "#BLSE-Services arm to acquire SBI, HDFC Bank CSPs for ₹6.5 crore  LinkedIn", "2025-06-24T17:56:42": "Chah ujor uwa chim ram na ka SBI Khliehriat yow thied Truck tangwa ym su u kawa dapoi palat Rs. 26 lak  Wyrta", "2025-06-24T18:22:30": "3 dead, including two teens, in Wake County house fire, SBI part of investigation  WRAL.com", "2025-06-24T21:12:07": "SBI (OTCMKTS:SBHGF) Reaches New 52-Week High - Here's Why  MarketBeat", "2025-06-24T23:42:45": "SBI organises blood donation camp  Daily Excelsior", "2025-06-24T23:59:26": "Sarkari Naukri 2025 Today LIVE Updates: SBI PO, SSC CHSL, Anganwadi, PFRDA and Other Ongoing Recruitment  Times Now", "2025-06-25T00:23:48": "SBI Holdings to Repay 230 Billion Yen in Public Funds for SBI Shinsei Bank  TipRanks"}, "HDFCBANK": {"2025-06-24T12:13:59": "Delhi High Court seeks response from HDFC, RBI in unauthorised ₹74 lakh bank transfer case  Bar and Bench", "2025-06-24T14:17:53": "Mumbai News: Lilavati Hospital Trust Moves Bombay HC To Transfer Bribery Probe Against HDFC Bank CEO To CBI  Free Press Journal", "2025-06-24T16:06:58": "BLS E-Services Subsidiary Inks DeaL To Acquire CSPs Of SBI, HDFC Bank  BW Businessworld", "2025-06-24T16:36:31": "BLS E-Services arm to acquire SBI, HDFC Bank CSPs for ₹6.5 crore  CNBC TV18", "2025-06-24T17:17:06": "HDB Financial Services IPO: HDFC Bank arm raises ₹3,369 crore from anchor investors ahead of public issue  Mint", "2025-06-24T17:46:53": "HDB Financial Services IPO: HDFC Bank's arm raises ₹3,369 crore from anchor investors ahead of public issue  MSN", "2025-06-24T19:08:16": "HDFC Bank Credit Card Changes From July 1: Charges On Rent, Bill Payments Revised; Check Key Details  MSN", "2025-06-24T21:47:34": "HDB Financial IPO: Here’s how to apply under the HDFC Bank shareholders’ quota  Upstox", "2025-06-25T00:11:58": "Fraud at HDFC Bank: Woman’s Rs 39 lakh FDs cashed illegally, banker son under lens  Daily Excelsior", "2025-06-25T01:00:59": "From HDFC Bank, IRCTC to Hindustan Aeronautics – Here are 7 stocks to watch today  financialexpress.com"}, "HDFCLIFE": {"2025-06-24T12:14:29": "HDFC Life in Association with Society for Innovation & Entrepreneurship (SINE), IIT Bombay Launches HDFC Life InsUReka  thewire.in"}, "INFY": {"2025-06-24T12:16:20": "Infosys accuses Cognizant of poaching employees from its Helix team  CNBC TV18", "2025-06-24T12:32:52": "Google Trends: TCS, HCL Tech, Infosys, Wipro among most searched IT companies in last 7 days  financialexpress.com", "2025-06-24T14:49:22": "Infosys accuses Cognizant of poaching key talent to sabotage Helix platform  Storyboard18", "2025-06-24T15:01:12": "Infosys Sues Cognizant Over Alleged Poaching of Helix Talent, Names Senior Executives  outlookbusiness.com", "2025-06-24T16:05:09": "Infosys again accuses rival Cognizant of poaching staff, latter responds | 'Infosys caught stealing intellectual property' | Inshorts  Inshorts", "2025-06-24T16:50:29": "Infosys Announces Strategic Collaboration with Zoetis to Enhance Digital Capabilities  CXOToday.com"}, "MARUTI": {"2025-06-24T12:16:37": "Safest cars under Rs 10,00,000 in 2025: From Tata Punch to Maruti Dzire; these 5 budget-friendly picks lead on safety  Zee Business", "2025-06-24T12:28:53": "Maruti Suzuki Jimny Goes On A 2,000+ km Road Trip  carandbike", "2025-06-24T15:15:00": "My Experience Of Owning Two Fun-To-Drive Maruti Suzuki Hatchbacks  Team-BHP", "2025-06-24T17:32:07": "New Maruti Suzuki Escudo SUV expected to launch soon: Here’s what to expect  MSN"}, "HCLTECH": {"2025-06-24T12:17:46": "HCLTech, AMD Partner To Power Next-Gen Enterprise AI And Cloud Adoption  Yahoo Finance", "2025-06-24T12:26:33": "HCLTech Partners with AMD to Develop Future-Ready AI and Cloud Tools  Analytics India Magazine", "2025-06-24T12:29:02": "HCLTech, AMD launch innovation labs, training to fast-track enterprise AI  Business Standard", "2025-06-24T12:32:52": "Google Trends: TCS, HCL Tech, Infosys, Wipro among most searched IT companies in last 7 days  financialexpress.com", "2025-06-24T12:46:20": "HCL Technologies, AMD Partner to Drive Global Enterprise Digital Transformation  MarketScreener", "2025-06-24T13:09:07": "HCLTech and AMD to collaborate to develop solutions across AI, digital and cloud  BusinessLine", "2025-06-24T15:00:00": "AMD Lands Strategic Alliance With HCLTech To Serve Enterprises  CRN Magazine", "2025-06-24T15:10:41": "HCLTech, AMD Partner To Build Future-ready AI And Cloud Solutions  BW Businessworld", "2025-06-24T16:55:35": "HCLTech & AMD Partner for AI, Cloud Innovation  Rediff MoneyWiz"}, "RELIANCE": {"2025-06-24T12:23:35": "Reliance Jio Launches AX6000 Wi-Fi 6 Router: Check Out all the Details  Techlusive", "2025-06-24T14:40:11": "Modi: No Safe Haven for Terrorists; Hails India's Defence Self-Reliance  Deccan Chronicle", "2025-06-24T16:34:10": "Is U.S. Lumber Self-Reliance Possible?  LBM Journal", "2025-06-24T19:19:44": "Reliance Retail to bring luxe arm under its fold to boost efficiency  The Economic Times", "2025-06-24T21:50:32": "Reliance Global Group Amends Credit Facility Agreement  TipRanks", "2025-06-24T21:54:04": "Reliance Global Group raises credit facility limit to $2 million with YES Americana  Investing.com", "2025-06-25T00:00:00": "Mukesh Ambani’s bold ambitions: Building businesses of the future  McKinsey & Company"}, "TCS": {"2025-06-24T12:32:52": "Google Trends: TCS, HCL Tech, Infosys, Wipro among most searched IT companies in last 7 days  financialexpress.com", "2025-06-24T13:21:38": "TCS plans big Rs 4,500 crore push: New campuses, office spaces & more in key cities - check details  MSN", "2025-06-24T14:36:00": "B.Tech Graduates in Wipro, Infosys, TCS Earning Less Than Plumbers & Electricians? The Brutal Reality!  Careers360", "2025-06-24T15:05:03": "City Of Tuscaloosa Expands Program Offering Free College Credits To TCS Students  Patch", "2025-06-24T15:28:27": "West Bengal government allots 20 acres of land to Tata Consultancy Services to build office campus  Moneycontrol", "2025-06-24T15:47:38": "TCS to build massive campus in Bengal Silicon Valley, CM Mamata Banerjee says it will create 25,000 jobs  financialexpress.com", "2025-06-24T17:27:23": "TCS to set up 20 acres campus in Kolkata  The Economic Times", "2025-06-24T18:00:09": "TCS to set up 20 acres campus in Kolkata  StartupNews.fyi", "2025-06-24T19:35:11": "TCS gets nod for mega campus in Bengal Silicon Valley; ‘25K jobs expected’  MillenniumPost", "2025-06-24T19:44:00": "TCS office campus bldg plan sanctioned, posts Mamata  Times of India", "2025-06-24T20:30:00": "TCS board takes step toward levy  Advertiser-Tribune", "2025-06-24T22:41:50": "'Bengal means business': TCS to set up 20-acre Kolkata campus; facility to create 25,000 jobs, says Mamata Banerjee  MSN", "2025-06-24T22:55:00": "Turning complexity into competitive advantage  AFR"}, "WIPRO": {"2025-06-24T12:32:52": "Google Trends: TCS, HCL Tech, Infosys, Wipro among most searched IT companies in last 7 days  financialexpress.com", "2025-06-24T14:36:00": "B.Tech Graduates in Wipro, Infosys, TCS Earning Less Than Plumbers & Electricians? The Brutal Reality!  Careers360", "2025-06-24T20:28:20": "Wipro Announces Virtual AGM for July 2025  TipRanks"}, "ADANIPOWER": {"2025-06-24T12:37:04": "Adani Power Shows Mixed Performance Amidst Yearly Decline and Market Challenges  MarketsMojo"}, "NTPC": {"2025-06-24T12:47:56": "NTPC Board Seeks Shareholders Nod To Raise Up To Rs 18,000 Crore Via Bonds -  Khabar India", "2025-06-24T13:00:49": "Assam: PIB hosts ‘Viksit Bharat Ka Amrit Kal’ media workshop at NTPC Kokrajhar  India Today NE", "2025-06-24T13:20:41": "RRB NTPC Exam Date 2025, Undergraduate and Graduate Exam Schedule  Adda247", "2025-06-24T13:36:19": "NTPC’s Kamal Nath Thakur conferred with ‘CMA of the Year Award 2024’  PSU Watch", "2025-06-24T16:40:00": "Levy suspected as armed men attack NTPC-linked project site  The Statesman", "2025-06-25T00:35:00": "RRB NTPC UG Admit Card 2025 Live Updates: Download CBT 1 Hall Ticket @ rrb.digialm.com  Shiksha"}, "AXISBANK": {"2025-06-24T12:51:57": "Axis Bank allots 1 11 lakh equity shares under ESOP  Capital Market"}, "ONGC": {"2025-06-24T13:07:10": "Making measured strategic progress in capping oil well leak ONGC  theweek.in", "2025-06-24T15:12:37": "ONGC faces legal heat for running Bhatiapar rig without environmental clearance amid ongoing gas blowout  Syllad", "2025-06-24T15:13:52": "ONGC Maintains Operational Momentum Despite Weather Challenges  BW Businessworld", "2025-06-24T16:02:40": "Assam gas leak: PCB serves show-cause notice to ONGC for unauthorised operations  Hindustan Times", "2025-06-24T16:04:34": "ONGC continues well-capping Ops in Assam's Sivasagar despite rain  tripuratimes.com", "2025-06-24T16:32:32": "ONGC deploys 200-ton crane at Assam gas leak site as well capping preparations advance  PSU Watch", "2025-06-24T16:49:04": "Assam Gas Leak: Environmental Watchdog Hits ONGC With Regulatory Action  Zee News", "2025-06-24T21:05:20": "ONGC woman employee duped of Rs 1.36 crore  Ahmedabad Mirror"}, "TATASTEEL": {"2025-06-24T13:14:06": "Analyst flags breakout above ₹154 for Tata Steel | Tap to know more | Inshorts  Inshorts", "2025-06-24T16:24:31": "Israel-Iran conflict may lead to steel price escalation: Tata Steel MD TV Narendran  The Avenue Mail", "2025-06-24T17:42:27": "Iran-Israel conflict not to have much impact on Tata Steel unless it lasts long: Narendran  CNBC TV18"}, "TATAMOTORS": {"2025-06-24T13:34:49": "Focus to regain 50% market share in electric cars in long term: Tata Motors  outlookbusiness.com", "2025-06-24T13:35:07": "Tata Harrier EV variants explained: Which one to buy?  financialexpress.com", "2025-06-24T13:55:19": "No immediate impact of rare earth magnet shortage on EV launches, portfolio: Tata Motors  BusinessLine", "2025-06-24T13:58:00": "Tata Motors says ‘no panic’ about rare earth shortage, EV plans unshaken  TimesLIVE", "2025-06-24T14:16:16": "No panic button pressed, supplies are coming through: Tata Motors on rare earth magnet crisis  Business Today", "2025-06-24T15:02:45": "Better equipped to tackle supply chain woes from lessons learnt during chip crisis: Tata Motors  The Economic Times", "2025-06-24T15:16:17": "Stocks to Watch: Tata Motors, HAL, Vodafone Idea, IRCTC and more  CNBC TV18", "2025-06-24T16:49:40": "Tata Motors has 'comfortable' stocks, supplies of rare-earth magnets  Business Standard", "2025-06-24T17:07:20": "JLR to begin car assembly in Tamil Nadu by 2026; Tata Motors delays Avinya EV launch  The Economic Times", "2025-06-24T17:42:00": "Tata Motors says JLR ready for supply shocks, no US plant despite tariff hit; Avinya EVs delayed to late  Times of India", "2025-06-25T00:13:29": "Stocks to Watch Today on June 25: HAL, IRCTC, Vodafone Idea, Tata Motors & more  ET Now"}, "BRITANNIA": {"2025-06-24T13:58:28": "Reform's Zia Yusuf hits back at Britannia Card criticism  Professional Adviser", "2025-06-24T14:48:02": "Britannia Row supports Sharon Van Etten & The Attachment Theory’s Tour  tpimagazine.com", "2025-06-24T14:48:45": "BGC Britannia Stakes charity initiative raises £450,000 for seven charities  Gambling Insider", "2025-06-24T16:48:47": "Charites to receive £450,000 as part of Britannia Stakes initiative  Racing Post", "2025-06-24T16:53:33": "Blighty newsletter: Britannia waves the rules  The Economist", "2025-06-24T21:54:03": "How nepo baby offspring of Britpop stars are leading re-birth of Cool Britannia – but one key part won’t be...  The Sun"}, "HINDALCO": {"2025-06-24T14:09:57": "Hindalco to acquire US-based AluChem for $125 million  The Economic Times", "2025-06-24T14:39:16": "Hindalco Industries acquires specialty alumina manufacturer AluChem Companies for $125 mn  Moneycontrol", "2025-06-24T14:47:53": "Hindalco to acquire US-based AluChem for $125 million  financialexpress.com", "2025-06-24T14:49:52": "Hindalco Industries to acquire US-based AluChem for $125 million  Business Standard", "2025-06-24T14:59:33": "Hindalco arm to acquire US-based AluChem for $125 million  CNBC TV18", "2025-06-24T15:05:37": "Hindalco acquires US co AluChem for $125 m  BusinessLine", "2025-06-24T15:15:43": "#Hindalco arm to acquire US-based #AluChem for $125 million  LinkedIn", "2025-06-24T15:39:19": "Hindalco Industries acquires North America-based Aluchem Companies for ₹1,075 cr  Fortune India", "2025-06-24T15:39:40": "Hindalco acquisition: Rs 1,074 cr deal! KM Birla firm to acquire THIS company  ET Now", "2025-06-24T15:41:10": "Hindalco to acquire US-based AluChem Companies Inc for $125 million  Upstox", "2025-06-24T15:44:21": "Hindalco to Acquire US-Based AluChem Companies for $125 Million  Autocar Professional", "2025-06-24T15:51:02": "Hindalco Industries to Acquire AluChem Companies Inc for USD 125 Million to Expand Global Presence  Goodreturns", "2025-06-24T16:07:00": "Hindalco to acquire US-based AluChem for $125 million, to expand global specialty alumina footprint; targ  Times of India", "2025-06-24T17:06:16": "Hindalco to acquire AluChem for $125 million as it expands into high-tech alumina | Company Business News  Mint", "2025-06-24T17:22:21": "Hindalco to acquire AluChem for $125 mn to grow speciality alumina reach  Business Standard", "2025-06-24T18:01:55": "Hindalco's £125 million speciality alumina acquisition  Aluminium International Today", "2025-06-24T18:05:58": "Hindalco To Acquire US-based AluChem Companies Inc For $125 Million  NDTV Profit", "2025-06-24T18:39:13": "Hindalco to buy US-based AluChem for $125 mn  The Economic Times", "2025-06-24T19:17:21": "Hindalco to acquire US-based AluChem for $125 mn  The New Indian Express", "2025-06-24T22:02:00": "Hindalco to buy AluChem for $125 million, its 3rd US deal  Times of India"}, "LT": {"2025-06-24T14:20:10": "Lt. Governor Rachel Hunt Champions Workforce Education During Forsyth Tech Visit in Statewide Tour  Hoodline", "2025-06-24T14:58:49": "Second World War veteran and Gurkha officer celebrates his 100th birthday  Forces News", "2025-06-24T16:04:09": "LT Overton's preseason profile, No. 29 player on our top 50 list for 2025  College Sports Wire", "2025-06-24T17:31:00": "Texas hemp supplier offers 20% discount after Lt. Gov. Dan Patrick calls THC merchants 'terrorists'  San Antonio Current", "2025-06-24T19:33:27": "Lt. Gov. Dan Patrick \"puzzled\" by Texas Gov. Greg Abbott's veto of bill banning THC, saying \"the governor of the state of Texas wants to legalize recreational marijuana\"  CBS News", "2025-06-24T23:00:01": "Will 2025 be the Final Season of 49ers LT Trent Williams' Career?  Sports Illustrated"}, "ITC": {"2025-06-24T14:37:30": "ITC’s digital store goes offline as it bets big on e-commerce and d2C  BusinessLine", "2025-06-24T14:54:00": "Trump’s ‘One Big Beautiful Bill’ is one big betrayal of American energy progress  Fortune", "2025-06-24T15:40:29": "ITC general exclusion orders: a consideration for patent owners amid tariff uncertainty  Reuters", "2025-06-24T20:30:00": "Savour a taste of Bihar at Grand Market Pavilion, ITC Royal Bengal  t2ONLINE"}, "SUNPHARMA": {"2025-06-24T16:01:46": "Sun Pharma’s Tildrakizumab Study: A Potential Game-Changer for Psoriatic Arthritis Treatment  TipRanks", "2025-06-24T16:06:53": "Sun Pharma’s Sonidegib Safety Study: Key Insights for Investors  TipRanks", "2025-06-24T19:33:26": "Sun Pharma Schedules Analyst and Investor Meeting  TipRanks"}, "TECHM": {"2025-06-24T16:27:06": "Large accounts, Americas and Europe to be top priority for TechM in FY26  BusinessLine"}, "ADANIPORTS": {"2025-06-24T19:38:27": "Adani Ports Modernizes Governance with AOA Amendment  TipRanks"}}